01-Sim/sphereQuad/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          2500;
        startFace       737500;
    }
    outlet
    {
        type            patch;
        nFaces          2500;
        startFace       740000;
    }
    externalFlow
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       742500;
    }
    symmetryWalls
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          10000;
        startFace       752500;
    }
)

// ************************************************************************* //
